ysfirmware/fw/STM32F051R8T6_MPPT/kit_test.c
/* ============================================================================ */
/*	kit_test.c : OK-STM32F0 키트 V1.0 하드웨어 테스트 프로그램		*/
/* ============================================================================ */
/*					programmed by Duck-Yong Yoon in 2013.   */

#include "stm32f0xx.h"
#include "OK-STM32F0.h"

/* ----- 사용자 함수 ---------------------------------------------------------- */

void Display_screen(void);			// display test screen
void Display_test(U08 current);			// display test number
void Test1(void);				// Test 1
void TFT_8color_horizontal(void);		// display 8 color bars
void Test2(void);				// Test 2
void Test3(void);				// Test 3
void Test4(void);				// Test 4
void Test5(void);				// Test 5
void Test6(void);				// Test 6
void Test7(void);				// Test 7
void DS3234_initialize(void);			// check DS3234 RTC
unsigned char DS3234_read(U16 address);		// read DS3234
void DS3234_write(U16 address, U08 value);	// write DS3234 
void Digital_display_time(void);		// display DS3234 time
unsigned char BCD_increment(U08 number);	// BCD increment
unsigned char BCD_decrement(U08 number);	// BCD decrement
void Digital_cursor_left(void);			// go cursor left
void Digital_cursor_right(void);		// go cursor right
void Digital_increment(void);			// increment time
void Digital_decrement(void);			// decrement time
void Test8(void);				// Test 8
void Analog_cursor_left(void);			// go cursor left
void Analog_cursor_right(void);             	// go cursor right
void Analog_increment(void);	               	// increment time
void Analog_decrement(void);	               	// decrement time
void Draw_analog_clock(void);			// draw analog clock
void Analog_display_time(void);			// display analog and digital time
void Draw_pin(void);				// draw hour, minute, second pin
void Line_soft(S16 x1,S16 y1, S16 x2,S16 y2, U16 color); // draw a soft line
void TFT_English_pixel(U16 Xpixel,U16 Ypixel, U08 code); // write a English ASCII character

/* ----- 메인 프로그램 -------------------------------------------------------- */

int main(void)
{
  unsigned char key = no_key, test = 1;

  Initialize_MCU();				// initialize MCU and kit
  Delay_ms(50);					// wait for system stabilization
  Initialize_LCD();				// initialize text LCD module
  Initialize_TFT_LCD();				// initialize TFT-LCD module
  Initialize_touch_screen();			// initialize touch screen

  ADC1->CR = 0x80000000;			// ADC calibration
  while(ADC1->CR & 0x80000000);
  Beep();					// beep

  LCD_string(0x80,"OK-STM32F0  V1.0");		// display title
  LCD_string(0xC0,"   kit_test.c   ");

  TFT_string(6, 6,Cyan,   Black,"    OK-STM32F0 키트 V1.0    ");
  TFT_string(6,10,White,Magenta,"  하드웨어 테스트 프로그램  ");
  TFT_string(6,18,White,  Black,"    2013년 09월 01일(일)    ");
  TFT_string(6,23,Green,  Black,"        윤덕용  작성        ");
  Delay_ms(3000);

  Display_screen();				// display test screen
  Display_test(test);				// display test number
  Beep();					// beep

  while(1)
    { while(key == no_key)			// wait key input
        key = Key_input();

      if(key == KEY3)				// if KEY3, decrenment test number
       { key = no_key;
         test--;
         if(test == 0) test = 8;
         Display_test(test);
       }
      else if(key == KEY4)			// if KEY4, increnment test number
       { key = no_key;
         test++;
         if(test > 8) test = 1;
         Display_test(test);
       }
      else if(key == KEY2)			// if KEY2, ignore and skip
       key = no_key;
      else if(key == KEY1)			// if KEY1, run test number
       { key = no_key;
         if(test == 1) Test1();
         else if(test == 2) Test2();
         else if(test == 3) Test3();
         else if(test == 4) Test4();
         else if(test == 5) Test5();
         else if(test == 6) Test6();
         else if(test == 7) Test7();
         else if(test == 8) Test8();

         Display_screen();			// display test screen
         Display_test(test);			// display test number
       }
    }
}

/* ---------------------------------------------------------------------------- */

void Display_screen(void)			/* display test screen */
{
  LCD_string(0xC0,"   kit_test.c   ");

  TFT_clear_screen();				// clear screen
  TFT_landscape_mode();				// landscape mode

  TFT_string( 0, 0,White,Magenta,"   OK-STM32F0 키트 V1.0 진단 프로그램   ");
  TFT_string( 0, 3,Cyan,   Black,"   (1) TFT-LCD 컬러 디스플레이 테스트");
  TFT_string( 0, 6,Green,  Black,"   (2) TFT-LCD 터치스크린 입력 테스트");
  TFT_string( 0, 9,Cyan,   Black,"   (3) MCO 단자 클록 출력 테스트");
  TFT_string( 0,12,Green,  Black,"   (4) A/D 컨버터 입력 테스트");
  TFT_string( 0,15,Cyan,   Black,"   (5) D/A 컨버터 출력 테스트");
  TFT_string( 0,18,Green,  Black,"   (6) RS-232C 직렬통신 루프백 테스트");
  TFT_string( 0,21,Cyan,   Black,"   (7) DS3234를 이용한 디지털 시계");
  TFT_string( 0,24,Green,  Black,"   (8) DS3234를 이용한 아날로그 시계");
  TFT_string( 0,28,White,   Blue,"KEY1(    )");
  TFT_string(20,28,White,   Blue," KEY3( ) ");
  TFT_string(31,28,White,   Blue," KEY4( ) ");
  TFT_string( 5,28,Red,     Blue,"실행");
  TFT_xy(26,28); TFT_English(0x18);
  TFT_xy(37,28); TFT_English(0x19);
}

void Display_test(U08 current)			/* display test number */
{
  TFT_string(0, 3,Cyan,   Black,"  ");
  TFT_string(0, 6,Green,  Black,"  ");
  TFT_string(0, 9,Cyan,   Black,"  ");
  TFT_string(0,12,Green,  Black,"  ");
  TFT_string(0,15,Cyan,   Black,"  ");
  TFT_string(0,18,Green,  Black,"  ");
  TFT_string(0,21,Cyan,   Black,"  ");
  TFT_string(0,24,Green,  Black,"  ");
  TFT_string(0,current*3, Yellow,Black,">>");
}
/* ---------------------------------------------------------------------------- */

void Test1(void)				/* Test 1 */
{
  unsigned short i, x, y;

  LCD_string(0xC0,"     Test 1     ");

  TFT_clear_screen();				// clear screen
  TFT_landscape_mode();				// landscape mode

  TFT_string( 0, 0,Green,  Black,"****************************************");
  TFT_string( 0, 2,Magenta,Black," Cortex-M0 시리즈  OK-STM32F0 키트 V1.0 ");
  TFT_string( 0, 4,Cyan,   Black,"       (TFT-2432A 보드 V1.0 포함)       ");
  TFT_string( 0, 6,Green,  Black,"****************************************");
  TFT_string( 0, 8,Black,  Black,"                                        ");
  TFT_string( 0,10,Magenta,Black,"      (디스플레이 모드 = Landscape)     ");
  TFT_string( 0,14,Cyan,   Black,"    3.2인치, 320x240 픽셀, 65536 컬러   ");
  TFT_string( 0,16,White,  Black," 컨트롤러/드라이버 HX8347-G(대만 Himax) ");
  TFT_string( 0,20,Red,    Black," 빨강 Red    ");
  TFT_string(13,20,Green,  Black," 녹색 Green  ");
  TFT_string(26,20,Blue,   Black," 파랑 Blue    ");
  TFT_string( 0,22,Yellow, Black," 노랑 Yellow ");
  TFT_string(13,22,Cyan,   Black," 녹청 Cyan   ");
  TFT_string(26,22,Magenta,Black," 자홍 Magenta ");
  TFT_string( 0,24,Black,  Black,"                                        ");
  TFT_string( 0,26,White,  Blue, "     윤교수의 마이크로프로세서 월드     ");
  TFT_string( 0,28,Green,  Black,"       (http://cpu.kongju.ac.kr/)       ");
  Delay_ms(5000);

