ysfirmware/fw/STM32F051R8T6_MPPT/kit_test.c
  TFT_clear_screen(); 				// clear screen
  TFT_portrait_mode();				// portrait mode

  TFT_string( 0, 0,Green,  Black,"******************************");
  TFT_string( 0, 2,Magenta,Black,"     OK-STM32F0 키트 V1.0     ");
  TFT_string( 0, 4,Cyan,   Black,"  (TFT-2432A 보드 V1.0 포함)  ");
  TFT_string( 0, 6,Green,  Black,"******************************");
  TFT_string( 0, 8,Black,  Black,"                              ");
  TFT_string( 0,10,Magenta,Black," (디스플레이 모드 = Portrait) ");
  TFT_string( 0,14,Cyan,   Black,"    3.2인치, 240x320 픽셀     ");
  TFT_string( 0,16,Yellow, Black,"          65536 컬러          ");
  TFT_string( 0,20,Red,    Black,"    16비트 CPU 인터페이스     ");
  TFT_string( 0,24,White,  Black,"  컨트롤러/드라이버 HX8347-G  ");
  TFT_string( 0,26,White,  Black,"         (대만 Himax)         ");
  TFT_string( 0,30,Red,    Black," 빨강 Red ");
  TFT_string(10,30,Green,  Black," 녹색 Gre ");
  TFT_string(20,30,Blue,   Black," 파랑 Blu ");
  TFT_string( 0,32,Yellow, Black," 노랑 Yel ");
  TFT_string(10,32,Cyan,   Black," 녹청 Cya ");
  TFT_string(20,32,Magenta,Black," 자홍 Mag ");
  TFT_string( 0,36,White,  Blue, "윤교수의 마이크로프로세서 월드");
  TFT_string( 0,38,Green,  Black,"  (http://cpu.kongju.ac.kr/)  ");
  Beep();
  Delay_ms(5000);

  TFT_clear_screen();				// clear screen
  TFT_landscape_mode();				// landscape mode

  TFT_8color_horizontal();			// display 8 color bars
  TFT_string(18, 1,Black,Transparent,"백색");
  TFT_string(18, 5,White,Transparent,"흑색");
  TFT_string(18, 8,Green,Transparent,"적색");
  TFT_string(18,12,Red,  Transparent,"녹색");
  TFT_string(18,16,Cyan, Transparent,"청색");
  TFT_string(18,20,Black,Transparent,"노랑");
  TFT_string(18,24,Red,  Transparent,"녹청");
  TFT_string(18,27,White,Transparent,"자홍");
  Beep();
  Delay_ms(5000);

  TFT_clear_screen();				// clear screen
  TFT_landscape_mode();				// landscape mode
  Beep();

  Rectangle(0,0, 319,239, Magenta);		// graphic show of line
  Rectangle(1,1, 318,238, Magenta);
  for(x = 10; x <= 310; x += 10)
    { Line(x,0, x,239, Green);
      Delay_ms(20);
    }
  for(y = 10; y <= 230; y += 10)
    { Line(0,y, 319,y, Green);
      Delay_ms(20);
    }
  Delay_ms(3000);
  TFT_clear_screen();

  Rectangle(0,0, 319,239, Magenta);		// graphic show of ramp
  Rectangle(1,1, 318,238, Magenta);
  for(i = 0,x = 20,y = 12; i <= 34; i++,x += 20,y += 12)
    { Line(x,0, 0,y, Red);
      Line(0,239-y, x,239, Red);
      Delay_ms(20);
    }
  for(i = 0,x = 700,y = 420; i <= 34; i++,x -= 20,y -= 12)
    { Line(x,0, 0,y, Cyan);
      Line(0,239-y, x,239, Cyan);
      Delay_ms(20);
    }
  Delay_ms(3000);
  TFT_clear_screen();

  Rectangle(0,0, 319,239, Magenta);		// graphic show of rectangle
  Rectangle(1,1, 318,238, Magenta);
  for(i = 0,x = 152,y = 114; i <= 18; i++,x -= 8,y -= 6)
    { Rectangle(x,y, 319-x,239-y, Cyan);
      Delay_ms(20);
    }
  Delay_ms(1000);
  for(i = 0,x = 8,y = 6; i <= 18; i++,x += 8,y += 6)
    { Rectangle(x,y, 319-x,239-y, Red);
      Delay_ms(20);
    }
  for(i = 0,x = 152,y = 114; i <= 18; i++,x -= 8,y -= 6)
    { Rectangle(x,y, 319-x,239-y, Green);
      Delay_ms(20);
    }
  Delay_ms(3000);
  TFT_clear_screen();

  Rectangle(0,0, 319,239, Magenta);		// graphic show of circle
  Rectangle(1,1, 318,238, Magenta);
  for(i = 10; i <= 160; i += 10)
    { Circle(160,120,i, Green);
      Delay_ms(20);
    }
  Delay_ms(1000);
  for(i = 160; i >= 10; i -= 10)
    { Circle(160,120,i, Red);
      Delay_ms(20);
    }
  for(i = 10; i <= 160; i += 10)
    { Circle(160,120,i, White);
      Delay_ms(20);
    }
  Delay_ms(3000);
  TFT_clear_screen();

  Rectangle(0,0, 319,239, Magenta);		// graphic show of 2 circles
  Rectangle(1,1, 318,238, Magenta);
  for(i = 10; i <= 120; i += 10)
    { Circle(80,120,i, Green);
      Circle(240,120,i, Green);
      Delay_ms(20);
    }
  Delay_ms(1000);
  for(i = 120; i >= 10; i -= 10)
    { Circle(80,120,i, Red);
      Circle(240,120,i, Red);
      Delay_ms(20);
    }
  for(i = 10; i <= 120; i += 10)
    { Circle(80,120,i, Yellow);
      Circle(240,120,i, Yellow);
      Delay_ms(20);
    }
  Delay_ms(3000);
  TFT_clear_screen();

  Rectangle(0,0, 319,239, Magenta);		// graphic show of sine curve
  Rectangle(1,1, 318,238, Magenta);
  Line(0,120, 319,120, Magenta);
  for(i = 10; i <= 120; i += 10)
    { Sine(i, 0, Green);
      Delay_ms(20);
    }
  Delay_ms(1000);
  for(i = 10; i <= 120; i += 10)
    { Sine(i, 1, Blue);
      Delay_ms(20);
    }
  Delay_ms(3000);
  Beep();
}

unsigned int Color[8] =				// 8-color data
   { White, Black, Red, Green, Blue, Yellow, Cyan, Magenta };

void TFT_8color_horizontal(void)		/* display 8 color bars */
{
  unsigned int i, j, k;

  TFT_GRAM_address(0,0);

  for(i = 0; i < 8; i++)
    for(j = 0; j < 30; j++)
      for(k = 0; k < 320; k++)
        TFT_data(Color[i]);
}

/* ---------------------------------------------------------------------------- */

void Test2(void)				/* Test 2 */
{
  LCD_string(0xC0,"     Test 2     ");

  TFT_clear_screen();				// clear screen
  TFT_landscape_mode();				// landscape mode

  Rectangle(0,0, 319,239, Green);		// display title
  Rectangle(1,1, 318,238, Green);

  TFT_string(6,5,White,Magenta," ADS7846  터치스크린 테스트 ");

  TFT_string( 1, 1,Cyan,   Black,"(0,0)");
  TFT_string(32, 1,Cyan,   Black,"(319,0)");
  TFT_string( 1,27,Cyan,   Black,"(0,239)");
  TFT_string(30,27,Cyan,   Black,"(319,239)");

  TFT_string( 9, 9,Cyan,   Black," 원시 데이터");
  TFT_string(21, 9,Magenta,Black,            " x = 0000 ");
  TFT_string(21,11,Magenta,Black,            " y = 0000 ");
  TFT_string( 9,15,Cyan,   Black," 픽셀 데이터");
  TFT_string(21,15,Magenta,Black,            " x =  000 ");
  TFT_string(21,17,Magenta,Black,            " y =  000 ");
  TFT_string( 8,22,White,   Blue," 비프음 ");
  TFT_string(19,22,White,    Red," 테스트 종료 ");
  Rectangle(61,173, 130,194, White);
  Rectangle(149,173, 258,194, White);

  while(1)
    { Touch_screen_input();			// input touch screen

      TFT_color(Cyan,Black);
      TFT_xy(26,9);				// display 12-bit original X data
      TFT_unsigned_decimal(x_12bit,0,4);
      TFT_xy(26,11);				// display 12-bit original Y data
      TFT_unsigned_decimal(y_12bit,0,4);
      TFT_xy(27,15);				// display pixel X data
      TFT_unsigned_decimal(x_touch,0,3);
      TFT_xy(27,17);				// display pixel Y data
      TFT_unsigned_decimal(y_touch,0,3);

      if((x_touch >= 61) && (x_touch <= 130) && (y_touch >= 173) && (y_touch <= 194))
        { Beep();
          Delay_ms(200);
        }
      else if((x_touch >= 149) && (x_touch <= 258) && (y_touch >= 173) && (y_touch <= 194))
        { Beep();
          return;
	}
    }
}

/* ---------------------------------------------------------------------------- */

void Test3(void)				/* Test 3 */
{
  LCD_string(0xC0,"     Test 3     ");

  TFT_clear_screen();				// clear screen
  TFT_landscape_mode();				// landscape mode

  TFT_string(0,8,White,Magenta,"    MCO 단자(TP2) 주파수 출력 테스트    ");

  GPIOA->MODER &= 0xFFFCFFFF;			// PA8 = MCO(alternate function)
  GPIOA->MODER |= 0x00020000;
  GPIOA->AFR[1] &= 0xFFFFFFF0;
  RCC->CSR |= 0x00000001;			// LSION = 1
  RCC->CR2 |= 0x00000001;			// HSI14ON = 1

