ysfirmware/fw/STM32F051R8T6_MPPT/kit_test.c
  TFT_string( 0,16,Cyan,Black,"            MCO = LSI(40kHz)            ");
  RCC->CFGR &= 0xF8FFFFFF;			// MCO[2:0] = 010 = LSI
  RCC->CFGR |= 0x02000000;
  Delay_ms(5000);

  TFT_string( 0,16,Cyan,Black,"            MCO = HSI(8MHz)             ");
  Beep();
  RCC->CFGR &= 0xF8FFFFFF;			// MCO[2:0] = 101 = HSI
  RCC->CFGR |= 0x05000000;
  Delay_ms(5000);

  TFT_string( 0,16,Cyan,Black,"           MCO = HSI14(14MHz)           ");
  Beep();
  RCC->CFGR &= 0xF8FFFFFF;			// MCO[2:0] = 001 = HSI14
  RCC->CFGR |= 0x01000000;
  Delay_ms(5000);

  TFT_string( 0,16,Cyan,Black,"            MCO = HSE(16MHz)            ");
  Beep();
  RCC->CFGR &= 0xF8FFFFFF;			// MCO[2:0] = 110 = HSE
  RCC->CFGR |= 0x06000000;
  Delay_ms(5000);

  TFT_string( 0,16,Cyan,Black,"           MCO = PLL/2(24MHz)           ");
  Beep();
  RCC->CFGR &= 0xF8FFFFFF;			// MCO[2:0] = 111 = PLL/2
  RCC->CFGR |= 0x07000000;
  Delay_ms(5000);

  RCC->CSR &= 0xFFFFFFFE;			// LSION = 0
  RCC->CR2 &= 0xFFFFFFFE;			// HSI14ON = 0
  Beep();
}

/* ---------------------------------------------------------------------------- */

void Test4(void)				/* Test 4 */
{
  unsigned char i;
  unsigned short result;

  LCD_string(0xC0,"     Test 4     ");

  TFT_clear_screen();				// clear screen
  TFT_landscape_mode();				// landscape mode

  TFT_string(0,5,White,Magenta,"        A/D 컨버터  입력 테스트         ");
  TFT_string(9, 9,White,Black,"ADC0 (+5.0V) = +0.00V");
  TFT_string(9,12,White,Black,"ADC1 (+3.3V) = +0.00V");
  TFT_string(9,15,White,Black,"ADC2 ( VR1 ) = +0.00V");
  TFT_string(9,18,White,Black,"ADC3(LM35DZ) = +00.0 C");
  TFT_string(9,21,White,Black,"ADC17(+1.2V) = +0.00V");
  TFT_xy(29,18);
  TFT_English(0x7F);
  TFT_string(30,28,White,   Blue,"KEY4(    )");
  TFT_string(35,28,Red,     Blue,"종료");

  GPIOA->MODER |= 0x000000FF;			// use ADC0~ADC3
  RCC->APB2ENR |= 0x00000200;			// enable ADC clock
  RCC->CFGR |= 0x00004000;			// ADC clock = PCLK/4 = 48MHz/4 = 12MHz
  RCC->CFGR3 |= 0x00000100;

  ADC1->CR = 0x00000001;			// enable ADC
  ADC->CCR = 0x00400000;			// enable VREFINT
  ADC1->SMPR = 0x00000005;			// sampling time = 55.5 cycle
  ADC1->CFGR1 = 0x00000000;			// 12-bit resolution, single conversion mode
  ADC1->CFGR2 = 0x80000000;			// PCLK/4 = 12MHz

  while(1)
    { ADC1->CHSELR = 0x00000001;		// channel 0 (+5.0V)
      result = 0;
      for(i = 0; i < 16; i++)
        { ADC1->CR = 0x00000005;		// start conversion by software
          while(!(ADC1->ISR & 0x00000004));	// wait for end of conversion
          result += ADC1->DR;
          Delay_ms(1);
        }
      result >>= 4;				// calculate average
      TFT_xy(24,9);				// display voltage
      TFT_color(Cyan,Black);
      TFT_signed_float((float)result*2.*3.3/4096., 1, 2);

      ADC1->CHSELR = 0x00000002;		// channel 1 (+3.3V)
      result = 0;
      for(i = 0; i < 16; i++)
        { ADC1->CR |= 0x00000004;		// start conversion by software
          while(!(ADC1->ISR & 0x00000004));	// wait for end of conversion
          result += ADC1->DR;
          Delay_ms(1);
        }
      result >>= 4;				// calculate average
      TFT_xy(24,12);				// display voltage
      TFT_color(Cyan,Black);
      TFT_signed_float((float)result*2.*3.3/4096., 1, 2);

      ADC1->CHSELR = 0x00000004;		// channel 2 (VR1)
      result = 0;
      for(i = 0; i < 16; i++)
        { ADC1->CR |= 0x00000004;		// start conversion by software
          while(!(ADC1->ISR & 0x00000004));	// wait for end of conversion
          result += ADC1->DR;
          Delay_ms(1);
        }
      result >>= 4;				// calculate average
      TFT_xy(24,15);				// display voltage
      TFT_color(Cyan,Black);
      TFT_signed_float((float)result*3.3/4096., 1, 2);

      ADC1->CHSELR = 0x00000008;		// channel 3 (LM35DZ)
      result = 0;
      for(i = 0; i < 16; i++)
        { ADC1->CR |= 0x00000004;		// start conversion by software
          while(!(ADC1->ISR & 0x00000004));	// wait for end of conversion
          result += ADC1->DR;
          Delay_ms(1);
        }
      result >>= 4;				// calculate average
      TFT_xy(24,18);				// display temperature
      TFT_color(Magenta,Black);
      TFT_signed_float((float)result*330./4096., 2, 1);

      ADC1->CHSELR = 0x00020000;		// channel 17 (VREFINT)
      result = 0;
      for(i = 0; i < 16; i++)
        { ADC1->CR |= 0x00000004;		// start conversion by software
          while(!(ADC1->ISR & 0x00000004));	// wait for end of conversion
          result += ADC1->DR;
          Delay_ms(1);
        }
      result >>= 4;				// calculate average
      TFT_xy(24,21);				// display voltage
      TFT_color(Yellow,Black);
      TFT_signed_float((float)result*3.3/4096., 1, 2);

      Delay_ms(100);
      if(Key_input() == KEY4) return;
      Delay_ms(100);
      if(Key_input() == KEY4) return;
      Delay_ms(100);
      if(Key_input() == KEY4) return;
    }
}

/* ---------------------------------------------------------------------------- */

void Test5(void)				/* Test 5 */
{
  register unsigned short i, j;
  unsigned short x;
  unsigned short DAC_data[200];

  LCD_string(0xC0,"     Test 5     ");

  TFT_clear_screen();				// clear screen
  TFT_landscape_mode();				// landscape mode

  TFT_string(0,5,White,Magenta,"        D/A 컨버터  출력 테스트         ");

  GPIOA->MODER |= 0x00000300;			// PA4 = analog mode
  RCC->APB1ENR |= 0x20000000;			// enable DAC clock

  DAC->CR = 0x00000003;				// DAC enable, output buffer and trigger disable

  TFT_string(11,15,White,Black,"TP3(DAC1_OUT) 단자");
  TFT_string( 4,18,Cyan, Black,"약 500Hz의 삼각파 출력 (0~+3.3V)");

  for(x = 0; x <= 100; x++)			// calculate data of triangular wave
    DAC_data[x] = (unsigned short)((4095./100.) * (float)x);
  i = 1;
  for(x = 101; x < 200; x++)
    { DAC_data[x] = DAC_data[100-i];
      i++;
    }

  for(i = 0; i < 2500; i++)			// display for 5 sec
    { for(j = 0; j < 200; j++)
        { DAC->DHR12R1 = DAC_data[j];		// output data
          Delay_us(10);
        }
    }

  TFT_string(11,15,White,Black,"TP3(DAC1_OUT) 단자");
  TFT_string( 4,18,Cyan, Black,"약 500Hz의 정현파 출력 (0~+3.3V)");
  Beep();

  for(x = 0; x < 200; x++)			// calculate data of sinusoidal wave
    DAC_data[x] = (signed short)(2047. * sin(x * 1.8 * 3.141592 / 180.)) + 2047;

  for(i = 0; i < 2500; i++)			// display for 5 sec
    { for(j = 0; j < 200; j++)
        { DAC->DHR12R1 = DAC_data[j];		// output data
          Delay_us(10);
        }
    }

  Beep();
}

/* ---------------------------------------------------------------------------- */

void Test6(void)				/* Test 6 */
{
  unsigned char i, test_flag, RXD;
  unsigned char string[10] = { "OK-STM32F0" };

  LCD_string(0xC0,"     Test 6     ");

  TFT_clear_screen();				// clear screen
  TFT_landscape_mode();				// landscape mode

  TFT_string(0,4,White,Magenta,"     RS-232C 직렬통신 루프백 테스트     ");

