ysfirmware/fw/STM32F051R8T6_MPPT/kit_test.c
  TFT_string(1, 9,White,Black,"CN5 컨넥터에 RS-232C 케이블을 접속하고");
  TFT_string(6,12,White,Black,"2번핀과 3번핀을 연결하시오 !");
  TFT_string(9,18,Cyan, Black,"송신 문자 : ");
  TFT_string(9,21,Cyan, Black,"수신 문자 : ");
  Delay_ms(1000);

  GPIOA->MODER  = (GPIOA->MODER & 0xFFC3FFFF) | 0x00280000; // PA10, PA9 = alternate function
  GPIOA->AFR[1] = (GPIOA->AFR[1] & 0xFFFFF00F) | 0x00000110;
  RCC->APB2ENR |= 0x00004000;			// enable USART1 clock
  RCC->CFGR3 &= 0xFFFFFFFC;			// USART1 clock = PCLK

  USART1->CR1 = 0x00000000;			// 1 start bit, 8 data bit, oversampling = 16
  USART1->BRR = 2500;				// 19200 bps = 48MHz/19200
  USART1->CR2 = 0x00000000;			// LSB first, 1 stop bit
  USART1->CR3 = 0x00000000;			// 3 sampling bit
  USART1->CR1 = 0x0000000D;			// enable USART1, transmitter, receiver
  Delay_ms(1);
  RXD = USART1->RDR;				// dummy read

  test_flag = 0;
  for(i = 0; i < 10; i++)
    { USART1->TDR = string[i];			// transmit test data
      TFT_xy(21+i,18);				// display transmitted test data
      TFT_color(Green,Black);
      TFT_English(string[i]);
      Delay_ms(10);

      RXD = USART1->RDR;			// receive test data
      TFT_xy(21+i,21);				// display transmitted test data
      TFT_color(Magenta,Black);
      TFT_English(RXD);

      if(RXD == string[i])			// data OK ?
        test_flag++;

      Beep();
      Delay_ms(500);
    }

  if(test_flag == 10)
    { TFT_string(15,25,  Green,Black,"통신 OK !");
      Beep();
    }
  else
    { TFT_string(14,25,Magenta,Black,"통신 에러 !");
      Beep_3times();
    }

  Delay_ms(2000);
}

/* ---------------------------------------------------------------------------- */

void Test7(void)				/* Test 7 */
{
  unsigned int key;

  LCD_string(0xC0,"     Test 7     ");

  TFT_clear_screen();				// clear screen
  TFT_landscape_mode();				// landscape mode

  Rectangle(0,0, 319,239, Green);		// display title
  Rectangle(1,1, 318,238, Green);

  TFT_string( 5, 4,White,Magenta," DS3234를 이용한  디지털 시계 ");
  TFT_string(10,12,White,  Black,"0000년 00월 00일(월)");
  TFT_string(13,16,White,  Black,"오전 00:00:00");

  DS3234_initialize();				// initialize DS3234 RTC

  TFT_cursor(Red);				// display cursor
  Xcursor = 38;
  Ycursor = 16;

  while(1)
    { Digital_display_time();			// display clock

      key = Key_input();			// key input
      if((key == KEY4) && (Xcursor == 38) && (Ycursor == 16))
        { TFT_cursor(Transparent);
	  return;
        }

      switch(key)
        { case KEY1 : Digital_cursor_left();	// if KEY1, go cursor left
                      break;
          case KEY2 : Digital_cursor_right();	// if KEY2, go cursor right
                      break;
          case KEY3 : Digital_increment();	// if KEY3, increment time
                      break;
	  case KEY4 : Digital_decrement();	// if KEY4, decrement time
                      break;
	  default   : break;
        }
    }
}

unsigned char year, month, date, weekday, hour, minute, second;
unsigned char time_flag = 0;

void DS3234_initialize(void)			/* initialize DS3234 RTC */
{
  GPIOB->MODER &= 0xFFFFF033;			// PB1(-RTC_CS) = output
  GPIOB->MODER |= 0x00000A84;			// PB5(TS_MOSI),PB4(TS_MISO),PB3(TS_CLK) = alternate function
  GPIOB->BSRR = 0x00000002;			// -RTC_CS = 1
  GPIOB->AFR[0] &= 0xFF000FFF;			// PB5 = SPI1_MOSI, PB4 = SPI1_MISO, PB3 = SPI1_CLK

  RCC->AHBENR |= 0x00040000;			// enable clock of port B
  RCC->APB2ENR |= 0x00001000;			// enable SPI1 clock

  SPI1->CR1 = 0x0367;				// master mode, 48MHz/32 = 1.5MHz, CPOL = CPHA = 1
  SPI1->CR2 = 0x0F00;				// 16-bit data, disable SS output

  second =  DS3234_read(0x00);			// if not second, initialize
  minute =  DS3234_read(0x01);			// if not minute, initialize
  hour =  DS3234_read(0x02);			// if not 12 hour system, initialize
  weekday =  DS3234_read(0x03);			// if not weekday, initialize
  date =  DS3234_read(0x04);			// if not date, initialize
  month =  DS3234_read(0x05);			// if not month, initialize
  year =  DS3234_read(0x06);			// if not year, initialize

  if((second > 0x59) || (minute > 0x59) || (hour < 0x40) || (weekday > 0x07) || (date > 0x31) || (month > 0x12) || (year > 0x99))
    { DS3234_write(0x00, 0x00);			// second = 0x00
      DS3234_write(0x01, 0x00);			// minute = 0x00
      DS3234_write(0x02, 0x12 + 0x40);		// hour = 0x12 AM
      DS3234_write(0x03, 0x03);			// weekday = 0x03(Tuesday)
      DS3234_write(0x04, 0x15);			// date = 0x15
      DS3234_write(0x05, 0x01);			// month = 0x01
      DS3234_write(0x06, 0x13);			// year = 0x2013
      DS3234_write(0x0E, 0x00);			// control register
      DS3234_write(0x0F, 0x00);			// control register
    }
}

unsigned char DS3234_read(U16 address)		/* read DS3234 */
{
  unsigned short word;

  GPIOB->BRR = 0x00000002;			// -RTS_CS = 0
  SPI1->DR = address << 8;
  while((SPI1->SR & 0x0003) != 0x0003);
  word = SPI1->DR;
  GPIOB->BSRR = 0x00000002;			// -RTS_CS = 1

  return word & 0x00FF;
}

void DS3234_write(U16 address, U08 value)	/* write DS3234 */
{
  unsigned short word = 0;

  GPIOB->BRR = 0x00000002;			// -RTS_CS = 0
  SPI1->DR = ((0x80 + address) << 8) + value;
  while((SPI1->SR & 0x0003) != 0x0003);
  word |= SPI1->DR;
  GPIOB->BSRR = 0x00000002;			// -RTS_CS = 1
}

void Digital_display_time(void)			/* display DS3234 time */
{
  TFT_xy(10,12); TFT_color(Cyan,Black);		// display year
  TFT_hexadecimal(0x20, 2);
  year = DS3234_read(0x06);
  TFT_hexadecimal(year,2);
  TFT_xy(17,12); TFT_color(Cyan,Black);		// display month
  month = DS3234_read(0x05);
  TFT_hexadecimal(month,2);
  TFT_xy(22,12); TFT_color(Cyan,Black);		// display date
  date = DS3234_read(0x04);
  TFT_hexadecimal(date,2);
  weekday = DS3234_read(0x03);			// display weekday
  if(weekday == 0x01)      TFT_string(27,12,Cyan,Black,"일");
  else if(weekday == 0x02) TFT_string(27,12,Cyan,Black,"월");
  else if(weekday == 0x03) TFT_string(27,12,Cyan,Black,"화");
  else if(weekday == 0x04) TFT_string(27,12,Cyan,Black,"수");
  else if(weekday == 0x05) TFT_string(27,12,Cyan,Black,"목");
  else if(weekday == 0x06) TFT_string(27,12,Cyan,Black,"금");
  else if(weekday == 0x07) TFT_string(27,12,Cyan,Black,"토");
  TFT_xy(18,16); TFT_color(Green,Black);	// display hour
  hour = DS3234_read(0x02);
  TFT_hexadecimal(hour & 0x1F,2);
  if((hour & 0x20) == 0x00) TFT_string(13,16,White,Black,"오전");
  else                      TFT_string(13,16,White,Black,"오후");
  TFT_xy(21,16); TFT_color(Green,Black);	// display minute
  minute = DS3234_read(0x01);
  TFT_hexadecimal(minute,2);
  TFT_xy(24,16); TFT_color(Green,Black);	// display second
  second = DS3234_read(0x00);
  TFT_hexadecimal(second & 0x7F,2);
  TFT_xy(38,16); TFT_color(Green,Black);	// display home
  TFT_English(' ');

  TFT_string( 1,25,White,Blue," KEY1 ");
  TFT_string(11,25,White,Blue," KEY2 ");
  TFT_string(23,25,White,Blue," KEY3 ");
  TFT_string(33,25,White,Blue," KEY4 ");
  if((Xcursor == 38) && (Ycursor == 16))
    TFT_string(2,27,Red,  Black,"좌측      우측                  종료");
  else
    TFT_string(2,27,Red,  Black,"좌측      우측        증가      감소");

  if((minute == 0x00) && (second == 0x00) && (time_flag == 0))
    { time_flag = 1;
      Beep();
    }
  else if(second != 0x00)
    time_flag = 0;
}

unsigned char BCD_increment(U08 number)		/* BCD increment */
{ unsigned char i;

