ysfirmware/fw/STM32F051R8T6_MPPT/kit_test.c
  DS3234_initialize();				// initialize DS3234 RTC

  TFT_cursor(Magenta);				// display cursor by Magenta color
  Xcursor = 28;
  Ycursor = 37;

  start_flag = 0;

  TFT_string(0,1, White,Magenta," DS3234에 의한  아날로그 시계 "); // display title
  Draw_analog_clock();				// draw analog clock
  TFT_string( 8,37, Cyan,  Black, "오전");	// display digital clock
  TFT_string(13,37, Silver,Black, "00:00:00");

  while(1)
    { key = Key_input();			// key input
      if((key == KEY4) && (Xcursor == 28) && (Ycursor == 37))
        { TFT_cursor(Transparent);
  	  return;
        }

        switch(key)
        { case KEY1 : Analog_cursor_left();	// if KEY1, go cursor left
                      break;
          case KEY2 : Analog_cursor_right();	// if KEY2, go cursor right
                      break;
          case KEY3 : Analog_increment();	// if KEY3, increment time
                      break;
	  case KEY4 : Analog_decrement();	// if KEY4, decrement time
                      break;
	  default   : Analog_display_time();	// display time
	              break;
        }
    }
}

void Analog_cursor_left(void)			/* go cursor left */
{
  if     ((Xcursor == 28) && (Ycursor == 37)) { Xcursor = 20; Ycursor = 37; }
  else if((Xcursor == 20) && (Ycursor == 37)) { Xcursor = 17; Ycursor = 37; }
  else if((Xcursor == 17) && (Ycursor == 37)) { Xcursor = 14; Ycursor = 37; }
  else if((Xcursor == 14) && (Ycursor == 37)) { Xcursor = 10; Ycursor = 37; }
  else if((Xcursor == 10) && (Ycursor == 37)) { Xcursor = 19; Ycursor = 25; }

  else if((Xcursor == 19) && (Ycursor == 25)) { Xcursor = 17; Ycursor = 25; }
  else if((Xcursor == 17) && (Ycursor == 25)) { Xcursor = 14; Ycursor = 25; }
  else if((Xcursor == 14) && (Ycursor == 25)) { Xcursor = 11; Ycursor = 25; }
  else if((Xcursor == 11) && (Ycursor == 25)) { Xcursor = 28; Ycursor = 37; }
}

void Analog_cursor_right(void)			/* go cursor right */
{
  if     ((Xcursor == 28) && (Ycursor == 37)) { Xcursor = 11; Ycursor = 25; }
  else if((Xcursor == 11) && (Ycursor == 25)) { Xcursor = 14; Ycursor = 25; }
  else if((Xcursor == 14) && (Ycursor == 25)) { Xcursor = 17; Ycursor = 25; }
  else if((Xcursor == 17) && (Ycursor == 25)) { Xcursor = 19; Ycursor = 25; }
  else if((Xcursor == 19) && (Ycursor == 25)) { Xcursor = 10; Ycursor = 37; }

  else if((Xcursor == 10) && (Ycursor == 37)) { Xcursor = 14; Ycursor = 37; }
  else if((Xcursor == 14) && (Ycursor == 37)) { Xcursor = 17; Ycursor = 37; }
  else if((Xcursor == 17) && (Ycursor == 37)) { Xcursor = 20; Ycursor = 37; }
  else if((Xcursor == 20) && (Ycursor == 37)) { Xcursor = 28; Ycursor = 37; }
}

void Analog_increment(void)			/* increment time */
{
  if((Xcursor == 10) && (Ycursor == 37))	// in case of AM/PM
    { hour = DS3234_read(0x02);
      if((hour & 0x20) == 0x00) hour |= 0x20;
      else                      hour &= 0xDF;
      DS3234_write(0x02,hour);
    }
  else if((Xcursor == 14) && (Ycursor == 37))	// in case of hour
    { hour = DS3234_read(0x02);
      if((hour & 0x1F) == 0x12) hour = (hour & 0xE0) + 0x01;
      else                      hour = BCD_increment(hour);
      DS3234_write(0x02,hour);
    }
  else if((Xcursor == 17) && (Ycursor == 37))	// in case of minute
    { minute = DS3234_read(0x01);
      if(minute == 0x59)    minute = 0x00;
      else                  minute = BCD_increment(minute);
      DS3234_write(0x01,minute);
    }
  else if((Xcursor == 20) && (Ycursor == 37))	// in case of second
    { second = DS3234_read(0x00);
      if(second == 0x59)    second = 0x00;
      else                  second = BCD_increment(second);
      DS3234_write(0x00,second);
    }
  else if((Xcursor == 11) && (Ycursor == 25))	// in case of year
    { year = DS3234_read(0x06);
      if(year == 0x99)      year = 0x00;
      else                  year = BCD_increment(year);
      DS3234_write(0x06,year);
    }
  else if((Xcursor == 14) && (Ycursor == 25))	// in case of month
    { month = DS3234_read(0x05);
      if(month == 0x12)     month = 0x01;
      else                  month = BCD_increment(month);
      DS3234_write(0x05,month);
    }
  else if((Xcursor == 17) && (Ycursor == 25))	// in case of date
    { date = DS3234_read(0x04);
      if(date == 0x31)      date = 0x01;
      else                  date = BCD_increment(date);
      DS3234_write(0x04,date);
    }
  else if((Xcursor == 19) && (Ycursor == 25))	// in case of weekday
    { weekday = DS3234_read(0x03);
      if(weekday == 0x07)   weekday = 0x01;
      else                  weekday++;
      DS3234_write(0x03,weekday);
    }
}

void Analog_decrement(void)			/* decrement time */
{
  if ((Xcursor == 10) && (Ycursor == 37))	// in case of AM/PM
    { hour = DS3234_read(0x02);
      if((hour & 0x20) == 0x00) hour |= 0x20;
      else                      hour &= 0xDF;
      DS3234_write(0x02,hour);
    }
  else if((Xcursor == 14) && (Ycursor == 37))	// in case of hour
    { hour = DS3234_read(0x02);
      if((hour & 0x1F) == 0x01) hour = (hour & 0xE0) + 0x12;
      else                      hour = BCD_decrement(hour);
      DS3234_write(0x02,hour);
    }
  else if((Xcursor == 17) && (Ycursor == 37))	// in case of minute
    { minute = DS3234_read(0x01);
      if(minute == 0x00)    minute = 0x59;
      else                  minute = BCD_decrement(minute);
      DS3234_write(0x01,minute);
    }
  else if((Xcursor == 20) && (Ycursor == 37))	// in case of second
    { second = DS3234_read(0x00);
      if(second == 0x00)    second = 0x59;
      else                  second = BCD_decrement(second);
      DS3234_write(0x00,second);
    }
  else if((Xcursor == 11) && (Ycursor == 25))	// in case of year
    { year = DS3234_read(0x06);
      if(year == 0x00)      year = 0x99;
      else                  year = BCD_decrement(year);
      DS3234_write(0x06,year);
    }
  else if((Xcursor == 14) && (Ycursor == 25))	// in case of month
    { month = DS3234_read(0x05);
      if(month == 0x01)     month = 0x12;
      else                  month = BCD_decrement(month);
      DS3234_write(0x05,month);
    }
  else if((Xcursor == 17) && (Ycursor == 25))	// in case of date
    { date = DS3234_read(0x04);
      if(date == 0x01)      date = 0x31;
      else                  date = BCD_decrement(date);
      DS3234_write(0x04,date);
    }
  else if((Xcursor == 19) && (Ycursor == 25))	// in case of weekday
    { weekday = DS3234_read(0x03);
      if(weekday == 0x01)   weekday = 0x07;
      else                  weekday--;
      DS3234_write(0x03,weekday);
    }
}

