ysfirmware/fw/STM32F051R8T6_MPPT/kit_test.c
unsigned short Xcenter = 120;			// center x,y of analog clock
unsigned short Ycenter = 160;

void Draw_analog_clock(void)			/* draw analog clock */
{
 unsigned short i; 
 unsigned short scale_out = 118;
 unsigned short scale_in1 = 112;
 unsigned short scale_in2 = 106;
 signed short Xstart, Ystart, Xend, Yend;

 for(i = 0; i < 60 ; i++)			// draw clock scale
   if((i % 5) != 0)
     { Xstart = Xcenter + (signed short)(scale_in1*sin(3.141592/180*(i*6)));
       Ystart = Ycenter - (signed short)(scale_in1*cos(3.141592/180*(i*6)));
       Xend   = Xcenter + (signed short)(scale_out*sin(3.141592/180*(i*6)));
       Yend   = Ycenter - (signed short)(scale_out*cos(3.141592/180*(i*6)));

       Line_soft(Xstart,Ystart, Xend,Yend, LightGrey);
     }
 for(i = 0; i < 12 ; i++)
   { Xstart = Xcenter + (signed short)(scale_in2*sin(3.141592/180*(i*30)));
     Ystart = Ycenter - (signed short)(scale_in2*cos(3.141592/180*(i*30)));
     Xend   = Xcenter + (signed short)(scale_out*sin(3.141592/180*(i*30)));
     Yend   = Ycenter - (signed short)(scale_out*cos(3.141592/180*(i*30)));

     Line_soft(Xstart,Ystart, Xend,Yend, White);
   }

  Circle(Xcenter,Ycenter, 119, Cyan);		// draw outline
  Circle(Xcenter,Ycenter, 118, Cyan);

  for(i = 4; i > 0; i--)			// draw center
    Circle(Xcenter,Ycenter, i, Yellow);
}

void Analog_display_time(void)			/* display analog and digital time */
{
  second = DS3234_read(0x00);			// new second ?
  if(second == second_old)
    return;
  else
    second_old = second;

  minute = DS3234_read(0x01);
  hour = DS3234_read(0x02);
  weekday = DS3234_read(0x03);
  date = DS3234_read(0x04);
  month = DS3234_read(0x05);
  year = DS3234_read(0x06);

  TFT_xy(13,37);				// display hour
  TFT_color(Green,Black);
  TFT_hexadecimal(hour & 0x1F,2);
  if((hour & 0x20) == 0x00) TFT_string(8,37, Cyan,Black, "오전");
  else                      TFT_string(8,37, Cyan,Black, "오후");
  TFT_xy(16,37);				// display minute
  TFT_color(Green,Black);
  TFT_hexadecimal(minute,2);
  TFT_xy(19,37);				// display second
  TFT_color(Green,Black);
  TFT_hexadecimal(second,2);

  TFT_xy(28,37); TFT_color(Green,Black);	// display home
  TFT_English(' ');

  Draw_pin();					// draw hour, minute, second pin
  Circle(Xcenter,Ycenter, 5, Green);

  if((minute == 0x00) && (second == 0x00) && (time_flag == 0))
    { time_flag = 1;
      Beep();
    }
  else if((minute != 0x00) || (second != 0x00))
    { time_flag = 0;
      GPIOA->BSRR = 0x00001000;			// buzzer on
      Delay_us(100);				// delay 100 us
      GPIOA->BRR = 0x00001000;			// buzzer off
    }
}

signed short Xstart1_hour_old, Ystart1_hour_old, Xstart2_hour_old, Ystart2_hour_old, Xend_hour_old, Yend_hour_old;
signed short Xstart1_minute_old, Ystart1_minute_old, Xstart2_minute_old, Ystart2_minute_old, Xend_minute_old, Yend_minute_old;

signed short Xstart_second_old, Ystart_second_old, Xend_second_old, Yend_second_old;
signed short Xcircle_second_old, Ycircle_second_old;

void Draw_pin(void)				/* draw hour, minute, second pin */
{
  unsigned short i;
  unsigned short pin_hour, length_hour = 65;
  signed short Xstart1_hour, Ystart1_hour, Xstart2_hour, Ystart2_hour, Xend_hour, Yend_hour;

  unsigned short pin_minute, length_minute = 80;
  signed short Xstart1_minute, Ystart1_minute, Xstart2_minute, Ystart2_minute, Xend_minute, Yend_minute;

  unsigned short pin_second, length_second = 100, center_second = 80 ;
  signed short Xstart_second, Ystart_second, Xend_second, Yend_second;
  signed short Xcircle_second, Ycircle_second;

  pin_hour = ((hour & 0x10) >> 4)*10 + (hour & 0x0F);	// convert hour to binary
  pin_minute = (minute >> 4)*10 + (minute & 0x0F);	// convert minute to binary
  pin_second = (second >> 4)*10 + (second & 0x0F);	// convert second to binary

						// calculate hour variables
  Xstart1_hour = Xcenter + (signed short)(6*sin((pin_hour*30 + pin_minute/2. - 30)*3.141592/180.)+0.5);
  Ystart1_hour = Ycenter - (signed short)(6*cos((pin_hour*30 + pin_minute/2. - 30)*3.141592/180.)+0.5);

  Xstart2_hour = Xcenter + (signed short)(6*sin((pin_hour*30 + pin_minute/2. + 30)*3.141592/180.)+0.5);
  Ystart2_hour = Ycenter - (signed short)(6*cos((pin_hour*30 + pin_minute/2. + 30)*3.141592/180.)+0.5);

  Xend_hour = Xcenter + (signed short)(length_hour*sin((pin_hour*30 + pin_minute/2.)*3.141592/180.)+0.5);
  Yend_hour = Ycenter - (signed short)(length_hour*cos((pin_hour*30 + pin_minute/2.)*3.141592/180.)+0.5);

						 // calculate minute variables
  Xstart1_minute = Xcenter + (signed short)(6*sin((pin_minute*6 + pin_second/10. - 15)*3.141592/180.)+0.5);
  Ystart1_minute = Ycenter - (signed short)(6*cos((pin_minute*6 + pin_second/10. - 15)*3.141592/180.)+0.5);

  Xstart2_minute = Xcenter + (signed short)(6*sin((pin_minute*6 + pin_second/10. + 15)*3.141592/180.)+0.5);
  Ystart2_minute = Ycenter - (signed short)(6*cos((pin_minute*6 + pin_second/10. + 15)*3.141592/180.)+0.5);

  Xend_minute = Xcenter + (signed short)(length_minute*sin((pin_minute*6 + pin_second/10.)*3.141592/180.)+0.5);
  Yend_minute = Ycenter - (signed short)(length_minute*cos((pin_minute*6 + pin_second/10.)*3.141592/180.)+0.5);

						// calculate second variables
  Xstart_second = Xcenter + (signed short)(6*sin(3.141592/180.*(pin_second*6))+0.5);
  Ystart_second = Ycenter - (signed short)(6*cos(3.141592/180.*(pin_second*6))+0.5);

  Xend_second = Xcenter + (signed short)(length_second*sin(3.141592/180.*(pin_second*6))+0.5);
  Yend_second = Ycenter - (signed short)(length_second*cos(3.141592/180.*(pin_second*6))+0.5);
	
  Xcircle_second = Xcenter + (signed short)(center_second*sin(3.141592/180.*(pin_second*6))+0.5);
  Ycircle_second = Ycenter - (signed short)(center_second*cos(3.141592/180.*(pin_second*6))+0.5);

  if(start_flag == 0)				// initialize old value
    { start_flag = 1;

      Xstart1_hour_old = Xstart1_hour;
      Ystart1_hour_old = Ystart1_hour;
      Xstart2_hour_old = Xstart2_hour;
      Ystart2_hour_old = Ystart2_hour;
      Xend_hour_old = Xend_hour;
      Yend_hour_old = Yend_hour;

      Xstart1_minute_old = Xstart1_minute;
      Ystart1_minute_old = Ystart1_minute;
      Xstart2_minute_old = Xstart2_minute;
      Ystart2_minute_old = Ystart2_minute;
      Xend_minute_old = Xend_minute;
      Yend_minute_old = Yend_minute;

      Xstart_second_old = Xstart_second;
      Ystart_second_old = Ystart_second;
      Xend_second_old = Xend_second;
      Yend_second_old = Yend_second;
      Xcircle_second_old = Xcircle_second;
      Ycircle_second_old = Ycircle_second;
    }

						// delete old hour and minute pin
  if((Xend_hour != Xend_hour_old) || (Yend_hour != Yend_hour_old) || (Xend_minute != Xend_minute_old) || (Yend_minute != Yend_minute_old))
    { Line_soft(Xstart1_hour_old,Ystart1_hour_old, Xend_hour_old,Yend_hour_old, Black);
      Line_soft(Xstart2_hour_old,Ystart2_hour_old, Xend_hour_old,Yend_hour_old, Black);

