ysfirmware/fw/STM32F051R8T6_MPPT/kit_test.c
      Line_soft(Xstart1_hour_old+1,Ystart1_hour_old, Xend_hour_old,Yend_hour_old, Black);
      Line_soft(Xstart1_hour_old-1,Ystart1_hour_old, Xend_hour_old,Yend_hour_old, Black);
      Line_soft(Xstart2_hour_old+1,Ystart2_hour_old, Xend_hour_old,Yend_hour_old, Black);
      Line_soft(Xstart2_hour_old-1,Ystart2_hour_old, Xend_hour_old,Yend_hour_old, Black);

      Line_soft(Xstart1_hour_old,Ystart1_hour_old+1, Xend_hour_old,Yend_hour_old, Black);
      Line_soft(Xstart1_hour_old,Ystart1_hour_old-1, Xend_hour_old,Yend_hour_old, Black);
      Line_soft(Xstart2_hour_old,Ystart2_hour_old+1, Xend_hour_old,Yend_hour_old, Black);
      Line_soft(Xstart2_hour_old,Ystart2_hour_old-1, Xend_hour_old,Yend_hour_old, Black);

      Line_soft(Xstart1_minute_old,Ystart1_minute_old, Xend_minute_old,Yend_minute_old, Black);
      Line_soft(Xstart2_minute_old,Ystart2_minute_old, Xend_minute_old,Yend_minute_old, Black);

      Line_soft(Xstart1_minute_old+1,Ystart1_minute_old, Xend_minute_old,Yend_minute_old, Black);
      Line_soft(Xstart1_minute_old-1,Ystart1_minute_old, Xend_minute_old,Yend_minute_old, Black);
      Line_soft(Xstart2_minute_old+1,Ystart2_minute_old, Xend_minute_old,Yend_minute_old, Black);
      Line_soft(Xstart2_minute_old-1,Ystart2_minute_old, Xend_minute_old,Yend_minute_old, Black);

      Line_soft(Xstart1_minute_old,Ystart1_minute_old+1, Xend_minute_old,Yend_minute_old, Black);
      Line_soft(Xstart1_minute_old,Ystart1_minute_old-1, Xend_minute_old,Yend_minute_old, Black);
      Line_soft(Xstart2_minute_old,Ystart2_minute_old+1, Xend_minute_old,Yend_minute_old, Black);
      Line_soft(Xstart2_minute_old,Ystart2_minute_old-1, Xend_minute_old,Yend_minute_old, Black);
    }

  for(i = 3; i > 0; i--)			// delete old second pin
    Circle(Xcircle_second_old,Ycircle_second_old, i, Black);
  Line_soft(Xstart_second_old,Ystart_second_old, Xend_second_old,Yend_second_old, Black);

  TFT_color(Green,Black);			// display hour number
  TFT_English_pixel(112,54, '1'); TFT_English_pixel(120,54, '2');
  TFT_English_pixel(62,68, '1'); TFT_English_pixel(70,68, '1');
  TFT_English_pixel(164,68, '1');
  TFT_English_pixel(28,104, '1'); TFT_English_pixel(36,104, '0');
  TFT_English_pixel(202,104, '2');
  TFT_English_pixel(18,152, '9');
  TFT_English_pixel(216,152, '3');
  TFT_English_pixel(32,202, '8');
  TFT_English_pixel(202,202, '4');
  TFT_English_pixel(68,238, '7');
  TFT_English_pixel(164,238, '5');
  TFT_English_pixel(117,252, '6');

  TFT_color(Silver,Black);			// display slash and ()
  TFT_xy(12,25);
  TFT_English('/');
  TFT_xy(15,25);
  TFT_English('/');
  TFT_xy(18,25);
  TFT_English('(');
  TFT_xy(21,25);
  TFT_English(')');
  TFT_string(8,25, Green,Black, "20");		// display year
  TFT_hexadecimal(year,2);
  TFT_xy(13,25);				// display month
  TFT_hexadecimal(month,2);
  TFT_xy(16,25);				// display date
  TFT_hexadecimal(date,2);
  if(weekday == 0x01)      TFT_string(19,25, Red,Black, "일");	// display weekday
  else if(weekday == 0x02) TFT_string(19,25, Red,Black, "월");
  else if(weekday == 0x03) TFT_string(19,25, Red,Black, "화");
  else if(weekday == 0x04) TFT_string(19,25, Red,Black, "수");
  else if(weekday == 0x05) TFT_string(19,25, Red,Black, "목");
  else if(weekday == 0x06) TFT_string(19,25, Red,Black, "금");
  else if(weekday == 0x07) TFT_string(19,25, Red,Black, "토");

  Rectangle(59,197, 179,217, Green);
  Rectangle(60,198, 178,216, Silver);

  Line_soft(Xstart1_hour,Ystart1_hour, Xend_hour, Yend_hour, Magenta); // draw new hour pin
  Line_soft(Xstart2_hour,Ystart2_hour, Xend_hour, Yend_hour, Magenta);

  Line_soft(Xstart1_minute,Ystart1_minute, Xend_minute,Yend_minute, Cyan); // draw new minute pin
  Line_soft(Xstart2_minute,Ystart2_minute, Xend_minute,Yend_minute, Cyan);

  for(i = 3; i > 0; i--)			// draw new second pin
    Circle(Xcircle_second,Ycircle_second, i, Yellow);
  Line_soft (Xstart_second,Ystart_second, Xend_second,Yend_second, Yellow);

  Xstart1_hour_old = Xstart1_hour;		// store old value
  Ystart1_hour_old = Ystart1_hour;
  Xstart2_hour_old = Xstart2_hour;
  Ystart2_hour_old = Ystart2_hour;
  Xend_hour_old = Xend_hour;
  Yend_hour_old = Yend_hour;

  Xstart1_minute_old = Xstart1_minute;
  Ystart1_minute_old = Ystart1_minute;
  Xstart2_minute_old = Xstart2_minute;
  Ystart2_minute_old = Ystart2_minute;
  Xend_minute_old = Xend_minute;
  Yend_minute_old = Yend_minute;

  Xstart_second_old = Xstart_second;
  Ystart_second_old = Ystart_second;
  Xend_second_old = Xend_second;
  Yend_second_old = Yend_second;
  Xcircle_second_old = Xcircle_second;
  Ycircle_second_old = Ycircle_second;
}

void Line_soft(S16 x1,S16 y1, S16 x2,S16 y2, U16 color)	/* draw a soft line */
{
  int x, y;

  if(y1 != y2)					// if y1 != y2, y is variable
    { if(y1 < y2)				//              x is function
        for(y = y1; y <= y2; y++)
          { x = x1 + (y - y1)*(x2 - x1)/(y2 - y1);
            TFT_pixel(x, y, color);
          }
      else
        for(y = y1; y >= y2; y--)
          { x = x1 + (y - y1)*(x2 - x1)/(y2 - y1);
            TFT_pixel(x, y, color);
          }
    }
  if(x1 != x2)					// if x1 != x2, x is variable
    { if(x1 < x2)				//              y is function
        for(x = x1; x <= x2; x++)
          { y = y1 + (x - x1)*(y2 - y1)/(x2 - x1);
            TFT_pixel(x, y, color);
          }
      else
        for(x = x1; x >= x2; x--)
          { y = y1 + (x - x1)*(y2 - y1)/(x2 - x1);
            TFT_pixel(x, y, color);
          }
    }
}

void TFT_English_pixel(U16 Xpixel,U16 Ypixel, U08 code)	/* write a English ASCII character */
{
  unsigned char data, x, y;
  unsigned short pixel[8][16];

  for(x = 0; x < 8; x++)			// read English ASCII font
    { data = E_font[code][x];
      for(y = 0; y < 8; y++)
        { if(data & 0x01) pixel[x][y] = foreground;
	  else            pixel[x][y] = background;
	  data = data >> 1;
	}
    }

  for(x = 0; x < 8; x++)
    { data = E_font[code][x+8];
      for(y = 0; y < 8; y++)
	{ if(data & 0x01) pixel[x][y+8] = foreground;
	  else            pixel[x][y+8] = background;
	  data = data >> 1;
	}
    }

  for(y = 0; y < 16; y++)			// write in portrait mode
    for(x = 0; x < 8; x++)
      TFT_pixel(Xpixel + x, Ypixel + y, pixel[x][y]);
}
